vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA356_DFP.pdsc
    <condition id="allOf.device.CMSIS, device=MCXA356.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXA356_header"/>
      <require condition="device.MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.aoi.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA356.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MCXA356.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.cache_lpcac_n4a_mcxn.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.camera-common.condition_id">
      <require condition="allOf.driver.video-common, device=MCXA356.internal_condition"/>
    </condition>
    <condition id="allOf.driver.video-common, device=MCXA356.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-common"/>
      <require condition="device.MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ap1302.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.video-i2c, device=MCXA356.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-device-common, driver.video-i2c, device=MCXA356.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c"/>
      <require condition="device.MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-common.condition_id">
      <require condition="allOf.driver.camera-common, device=MCXA356.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-common, device=MCXA356.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common"/>
      <require condition="device.MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-max9286.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.video-i2c, device=MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-mt9m114.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.video-i2c, device=MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov5640.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXA356.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXA356.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-sccb"/>
      <require condition="device.MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov7670.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov7725.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-sccb.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA356.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA356.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.camera-receiver-common.condition_id">
      <require condition="allOf.driver.camera-common, device=MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.cdog.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.driver.mcx_spc, device=MCXA356.internal_condition"/>
    </condition>
    <condition id="allOf.driver.mcx_spc, device=MCXA356.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mcx_spc"/>
      <require condition="device.MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_gpio.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXA356.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXA356.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="GPIO" Capiversion="1.0.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device_id.MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MCXA356, device.RTE, device_id=MCXA356, driver.lpi2c_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MCXA356, device.RTE, device_id=MCXA356, driver.lpi2c_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpi2c, device_id=MCXA356.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXA356.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpi2c, device_id=MCXA356.internal_condition">
      <accept condition="allOf.driver.lpi2c, device_id=MCXA356.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpi2c, device_id=MCXA356.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device_id.MCXA356.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MCXA356, device.RTE, device_id=MCXA356, driver.lpspi_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MCXA356, device.RTE, device_id=MCXA356, driver.lpspi_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpspi, device_id=MCXA356.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXA356.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
    </condition>
