vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA356_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA356_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXA356_cmsis</description>
      <files>
        <file category="header" name="devices/MCXA356/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXA356/MCXA356.h" projectpath="device"/>
        <file category="header" name="devices/MCXA356/MCXA356_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXA356/MCXA356_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_ADC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_AOI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_CAN.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_CDOG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_CMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_CRC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_CTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_DEBUGMAILBOX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_DIGTMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_DMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_EIM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_EQDC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_ERM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_FLEXIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_FMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_FMU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_FREQME.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_GLIKEY.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_GPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_I3C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_INPUTMUX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_LCD.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_LPCMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_LPDAC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_LPI2C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_LPSPI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_LPTMR.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_LPUART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_MAU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_MRCC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_OPAMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_OSTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_PKC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_PORT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_PWM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_RTC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_SCG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_SGI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_SMARTDMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_SPC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_SYSCON.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_TRDC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_TRNG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_UDF.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_USB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_UTICK.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_VBAT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_WAKETIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_WUU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA356/periph2/PERI_WWDT.h" projectpath="device/periph2"/>
        <file category="include" name="devices/MCXA356/"/>
        <file category="include" name="devices/MCXA356/periph2/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA356/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA356/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXA356_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXA356_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA356.condition_id" category="linkerScript" name="devices/MCXA356/arm/MCXA356_flash.scf" projectpath="MCXA356/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA356.condition_id" category="linkerScript" name="devices/MCXA356/arm/MCXA356_ram.scf" projectpath="MCXA356/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA356.condition_id" category="linkerScript" name="devices/MCXA356/gcc/MCXA356_flash.ld" projectpath="MCXA356/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA356.condition_id" category="linkerScript" name="devices/MCXA356/gcc/MCXA356_ram.ld" projectpath="MCXA356/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA356.condition_id" category="linkerScript" name="devices/MCXA356/iar/MCXA356_flash.icf" projectpath="MCXA356/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA356.condition_id" category="linkerScript" name="devices/MCXA356/iar/MCXA356_ram.icf" projectpath="MCXA356/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXA356" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXA356</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA356/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA356/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA356/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA356/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA356/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA356/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA356/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA356/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA356/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXA356_startup</description>
      <files>
        <file condition="allOf.toolchains=armgcc, iar, mdk.condition_id" category="sourceC" attr="config" name="devices/MCXA356/startup_MCXA356.c" version="1.0.0" projectpath="startup"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA356_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXA356_system</description>
      <files>
        <file category="sourceC" name="devices/MCXA356/system_MCXA356.c" projectpath="device"/>
        <file category="header" name="devices/MCXA356/system_MCXA356.h" projectpath="device"/>
        <file category="include" name="devices/MCXA356/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.2" condition="driver.aoi.condition_id">
      <description>AOI Driver</description>
      <files>
        <file category="header" name="devices/MCXA356/drivers/fsl_aoi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA356/drivers/fsl_aoi.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA356/drivers/"/>
      </files>
    </component>
